[
  "Sam studies.",
  "Ava didn't sing.",
  "Ava failed to not eat.",
  "Alfred is a knight.",
  "Ava will stand only if Emily sits.",
  "Provided that Ava studies, she will pass.",
  "If Sam is a knight, then he is honest.",
  "If Sam is not a knight, then he is not honest.",
  "If Sam is a knave, then he is not honest.",
  "If Sam is not a knave, then he is a knight.",
  "If Ava will pass if she concentrates, then she is happy.",
  "Ava won't pass if she drank.",
  "Ava will pass if she didn't drink.",
  "If Ava is happy only if Sam didn't sing, then Sam won't stand if Ava sits.",
  "It is not the case that Ruth is happy.",
  "Ansel will bite only if he is sad.",
  "It is not the case that Ansel won't bite.",
  "If Sam sits, then it is not the case that he doesn't sit.",
  "It is not the case that it is not the case that Sam is honest.",
  "If Sam is a human, then he is mortal.",
  "If Alfred isn't wet, then he didn't swim.",
  "Ruth sang only if she didn't swim.",
  "Ava waved to Sam only if Sam waved to Ava.",
  "If Alfred didn't wave to Emily, then she is sad.",
  "Sam is a knight only if he is honest.",
  "Alfred will walk if Ruth will.",
  "Ava won't run if Sam won't.",
  "If Alfred doesn't study, he will pass only if he concentrates.",
  "If Sam sits, then if Ava doesn't sit, Ruth will stand.",
  "If Alfred won't stand if Ruth won't, then Sam won't.",
  "Ava is happy and Sam is happy",
  "Either Ruth studies or she won't pass.",
  "Sam is happy, but he won't pass.",
  "Sam is not honest if he is a knave.",
  "Ava will pass just in case she studies.",
  "Sam and Ansel are elves.",
  "Emily didn't drink or sing.",
  "Both Alfred and Sam swam.",
  "Ansel is a mean elf and he will bite.",
  "Ruth talked to Alfred and he isn't guilty, if she swam.",
  "Sam is happy only if he ate and drank.",
  "Ruth admires Ava or Emily, but she doesn't admire herself.",
  "Sam will stand if he is an honest person.",
  "Neither Ava nor Ruth kissed Sam.",
  "Alfred, but not Sam, talked to Ruth.",
  "Ava will pass just in case neither Sam nor Emily studies.",
  "Both Sam and Emily will pass if Ava will. ",
  "Sam will run or walk but he won't stand.",
  "Sam is an honest person but he isn't happy.  ",
  "Not both Sam and Ava drank.",
  "Alfred, who didn't swim, is wet.",
  "Either Emily or Ruth talked to Sam.",
  "Neither Emily nor Ruth talked to Sam.",
  "Alfred kissed Ruth and sang, or he drank.",
  "Ava drank but didn't sing.",
  "Ruth will run just in case Ava does.",
  "Sam is a monkey who will bite but he isn't mean.",
  "Alfred isn't honest, but Ruth loves him anyway.",
  "Ava is sad and wet or she isn't guilty.",
  "Ava climbs or she sits and concentrates.",
  "If neither Ava nor Sam will run, either Emily or Ruth will walk.",
  "Alfred didn't talk to Ruth and he didn't sing, but he will pass.",
  "Either Ava or Ruth will stand, but not both.",
  "Neither Alfred nor Sam will run, but if either Ava or Emily will, Ruth won't.",
  "Both Ava and Ruth are honest.",
  "Either Ava ate and Sam didn't, or Ruth ate and Alfred didn't.",
  "Alfred will run unless he ate.",
  "Alfred is a teacher but he is not mean.",
  "If neither Sam nor Alfred sits, Emily won't either.",
  "Neither Sam nor Alfred nor Emily will run. ",
  "Ava didn't talk to Ruth unless both swam.",
  "Sam is mortal.",
  "Ava is happy, and so is Sam. ",
  "Ansel or Ruth will walk.",
  "If Sam is not a knight, then he is not honest.",
  "Ava is an elf but Ruth isn't.",
  "Neither Sam nor Ruth sang, yet they are both happy.",
  "All humans are mortal.",
  "Everything is wet.",
  "Something is not wet.",
  "Some knights are sad.",
  "No knaves are honest.",
  "Not all teachers are honest.",
  "It's not the case that every monkey is wet.",
  "Some knights are not happy.",
  "Only humans are guilty.",
  "A monkey sang.",
  "Some people ate but Ava didn't.",
  "Every wet elf is guilty.",
  "Something is round and something is square, but nothing is both round and square.",
  "Every monkey is either happy or wet.",
  "Some monkeys climb but not all who climb are monkeys.",
  "Some students study but some don't. ",
  "Everything is a round square.",
  "If every wet monkey ate, then some monkey sang.",
  "There is something such that, if it is wet, then everything is wet.",
  "Either all happy elves are guilty, or all guilty elves are happy.",
  "Some monkeys ate and drank, but only wet monkeys swam.",
  "All elves who are mean will bite.",
  "No wet monkey is happy.",
  "Every guilty elf is sad and mean. ",
  "Only knights are honest.",
  "Some elf is not both mortal and happy. ",
  "No student is happy unless every student will pass.",
  "Each student is happy unless they won't pass. ",
  "All and only knights are honest.",
  "If a person is honest, they are happy.",
  "Sam loves Ava.",
  "Ava doesn't love Sam.",
  "Ruth admires Alfred or Sam, but she doesn't admire herself.",
  "Something sees Ava.",
  "Every student loves Sam.",
  "An elf loves Ava.",
  "No teacher talked to Ruth",
  "A student loves a student.",
  "Every elf sees every monkey.",
  "No student waved to any teacher.",
  "There is a student who every monkey sees.",
  "Some monkey sees itself.",
  "No student sees every monkey.",
  "Some knight and some knave admire each other.",
  "Alfred didn't talk to a happy elf and he didn't swim.",
  "Some student admires every teacher.",
  "Ruth is an admirer of people who have no admirers.",
  "Every monkey sees every human, and there is a monkey that every human sees.",
  "Every human waved to every elf but not every elf waved to every human.",
  "No elf waved to any other elf.",
  "Ruth is an admirer of those who have no admirers.",
  "Every monkey sees every human and every human sees a monkey.",
  "Every human waved to every elf but not every elf waved to every human.",
  "There is a number that is less than every number.",
  "Each number is less than some number.",
  "Some number doesn't have a number as its successor.",
  "Every number has a number as a successor.",
  "Either some number is greater than every number or every number has a number as a successor.",
  "Some knight loves every knave that loves it",
  "No person who is either student or a teacher talked to Alfred.",
  "Alfred admires all and only people who do not admire themselves.",
  "Every monkey sees every human, and every human sees some monkey.",
  "There is a student and a teacher such that the student didn't wave to the teacher.",
  "Each monkey sees some student.",
  "Not every teacher waved to Ruth.",
  "Ruth waved to every teacher.",
  "Every student loves and admires some teacher.",
  "Every monkey who is happy sees a student.",
  "Every student admires a teacher who admires a student.",
  "Every teacher admires a student who admires a teacher.",
  "There is a student who waved to a student and to a teacher.",
  "Every student waved to a teacher or a monkey.",
  "There is a student who every monkey waved to.",
  "Every student admires some teacher.",
  "Every teacher admires a student who admires them.",
  "No student admires every teacher.",
  "Some teacher admires only students.",
  "If no student or teacher waved to Ruth, then no teacher is happy.",
  "If no student waved to Ruth, then every teacher is happy.",
  "Sam is a knight",
  "Sam is honest."
]